.emacs.d/config.org
#+title: Emacs config
#+property: header-args :tangle init.el :lexical t

* Early init

** Garbage collector

#+begin_src emacs-lisp :tangle early-init.el
;; -*- lexical-binding: t; -*-

(defvar last-file-name-handler-alist file-name-handler-alist)

(setq gc-cons-threshold most-positive-fixnum
      gc-cons-percentage 0.6
      file-name-handler-alist nil)

(add-hook 'emacs-startup-hook
          #'(lambda ()
              (setq gc-cons-threshold (* 2 1000 1000)
                    file-name-handler-alist last-file-name-handler-alist)))
#+end_src

** User emacs directory

#+begin_src emacs-lisp :tangle early-init.el
(setq user-emacs-directory "~/.cache/emacs/")

(when (not (file-directory-p user-emacs-directory))
  (make-directory user-emacs-directory t))
#+end_src

** Native compile

#+begin_src emacs-lisp :tangle early-init.el
(setq package-native-compile t
      native-comp-deferred-compilation t
      native-comp-async-report-warnings-errors nil)

(setq native-comp-eln-load-path
      (list (expand-file-name "eln-cache" user-emacs-directory)))
#+end_src

** Package

#+begin_src emacs-lisp :tangle early-init.el
(setq package-enable-at-startup nil
      load-prefer-newer t)
#+end_src

** Visual

#+begin_src emacs-lisp :tangle early-init.el
(menu-bar-mode -1)
(tool-bar-mode -1)
(tooltip-mode -1)
(scroll-bar-mode -1)

(setq inhibit-startup-screen t
      inhibit-startup-echo-area-message t
      initial-scratch-message nil
      server-client-instructions nil
      inhibit-x-resources t)
#+end_src

* Package installer

#+begin_src emacs-lisp
;; -*- lexical-binding: t; -*-

(setq straight-check-for-modifications nil)

(defvar bootstrap-version)

(let ((bootstrap-file
       (expand-file-name "straight/repos/straight.el/bootstrap.el" user-emacs-directory))
      (bootstrap-version 5))
  (unless (file-exists-p bootstrap-file)
    (with-current-buffer
        (url-retrieve-synchronously
         "https://raw.githubusercontent.com/raxod502/straight.el/develop/install.el"
         'silent 'inhibit-cookies)
      (goto-char (point-max))
      (eval-print-last-sexp)))
  (load bootstrap-file nil 'nomessage))

(with-eval-after-load 'straight
  (setq straight-vc-git-default-clone-depth 1))
#+end_src

* Sane defaults

** Files

*** Custom

#+begin_src emacs-lisp
(setq custom-file (expand-file-name "custom.el" user-emacs-directory))

(when (file-exists-p custom-file)
  (load custom-file nil t))
#+end_src

*** Backup

#+begin_src emacs-lisp
(setq backup-directory-alist `((".*" . ,(expand-file-name "backups" user-emacs-directory)))
      backup-by-copying t
      version-control t
      delete-old-versions t
      vc-make-backup-files t
      kept-old-versions 10
      kept-new-versions 10)
#+end_src

*** Auto save

#+begin_src emacs-lisp
(setq auto-save-list-file-prefix (expand-file-name "autosaves/" user-emacs-directory)
      auto-save-file-name-transforms `((".*" ,(expand-file-name "autosaves/" user-emacs-directory) t)))
#+end_src

*** Recent

#+begin_src emacs-lisp
(setq recentf-max-saved-items 50
      recentf-auto-cleanup 300)

(recentf-mode 1)
#+end_src

*** Symlinks

#+begin_src emacs-lisp
(setq-default vc-follow-symlinks)
#+end_src

** Short answers

#+begin_src emacs-lisp
(setq use-short-answers t)
#+end_src

** EWW

#+begin_src emacs-lisp
(with-eval-after-load 'browse-url
  (when (getenv "BROWSER")
    (setq browse-url-generic-program (executable-find (getenv "BROWSER"))
          browse-url-browser-function 'browse-url-generic)))
#+end_src

** Default directory

#+begin_src emacs-lisp
(cd "~/")
#+end_src

** Coding system

#+begin_src emacs-lisp
(setq-default buffer-file-coding-system 'utf-8-unix
              default-file-name-coding-system 'utf-8-unix
              default-keyboard-coding-system 'utf-8-unix
              default-process-coding-system '(utf-8-unix . utf-8-unix)
              default-sendmail-coding-system 'utf-8-unix
              default-terminal-coding-system 'utf-8-unix)
#+end_src

** Automatically revert buffers

#+begin_src emacs-lisp
(global-auto-revert-mode 1)

(setq global-auto-revert-non-file-buffers t)
#+end_src

** Delete by moving to trash

#+begin_src emacs-lisp
(setq delete-by-moving-to-trash t
      trash-directory (expand-file-name "emacs-trash" temporary-file-directory))
#+end_src

** Stop large file warning

#+begin_src emacs-lisp
(setq large-file-warning-threshold nil)
#+end_src

** Tab indentation

#+begin_src emacs-lisp
(setq-default indent-tabs-mode nil
              tab-width 4)
#+end_src

** Delete selected region when input

#+begin_src emacs-lisp
(delete-selection-mode 1)
#+end_src

** Focus help window when opened

#+begin_src emacs-lisp
(with-eval-after-load 'help
  (setq help-window-select t))
#+end_src

** Pager environment variable

#+begin_src emacs-lisp
(setenv "PAGER" "cat")
(setenv "MANPAGER" "cat")
#+end_src

** Enable disabled commands

#+begin_src emacs-lisp
(setq disabled-command-function nil)
#+end_src

** Async shell command with $EDITOR

#+begin_src emacs-lisp
(global-set-key (kbd "M-&") 'with-editor-async-shell-command)
#+end_src

** Don't save duplicates to kill ring

#+begin_src emacs-lisp
(setq kill-do-not-save-duplicates t)
#+end_src

** Man pages

#+begin_src emacs-lisp
(with-eval-after-load 'woman
  (setq woman-fill-frame t))
#+end_src

* Utilities

** Insert buffer name

#+begin_src emacs-lisp
(defun crz/insert-buffer-name (buffer-name)
  (interactive "BName of buffer: ")
  (insert-and-inherit buffer-name))

(global-set-key (kbd "C-x x b") 'crz/insert-buffer-name)
#+end_src

** Pager minor-mode

#+begin_src emacs-lisp
(defvar-local hide-cursor--original nil)

(define-minor-mode pager-mode
  "View buffer as a pager."
  :global nil
  :lighter " Pager"
  (if pager-mode
      (progn
        (scroll-lock-mode 1)
        (setq-local hide-cursor--original
                    cursor-type)
        (setq-local cursor-type nil))
    (scroll-lock-mode 0)
    (setq-local cursor-type (or hide-cursor--original t))))
#+end_src

* Window management

** Movement

#+begin_src emacs-lisp
(straight-use-package 'ace-window)

(with-eval-after-load 'ace-window
  (setq aw-scope 'frame
        aw-ignore-current t))

(global-set-key (kbd "M-o") 'ace-window)
#+end_src

** Popup

#+begin_src emacs-lisp
(straight-use-package 'popper)

(with-eval-after-load 'popper
  (setq popper-reference-buffers
        '("\\*Async Shell Command\\*"
          "\\*DWIM shell command\\* done"
          grep-mode
          debugger-mode)))

(global-set-key (kbd "M-'") 'popper-toggle-latest)
(global-set-key (kbd "C-'") 'popper-cycle)
(global-set-key (kbd "C-M-'") 'popper-toggle-type)

(popper-mode 1)
(popper-echo-mode 1)
#+end_src

* Minibuffer

** History

#+begin_src emacs-lisp
(setq history-length 50
      history-delete-duplicates t)

(savehist-mode 1)
#+end_src

** Recursive minibuffers

#+begin_src emacs-lisp
(setq enable-recursive-minibuffers t)
#+end_src

** Completion UI

#+begin_src emacs-lisp
(straight-use-package 'vertico)

(vertico-mode 1)
#+end_src

** Completion style

#+begin_src emacs-lisp
(straight-use-package 'orderless)

(with-eval-after-load 'vertico
  (setq completion-styles '(orderless)
        orderless-matching-styles '(orderless-flex)))
#+end_src

** Additional completion commands

#+begin_src emacs-lisp
(straight-use-package 'consult)

(with-eval-after-load 'consult
  (consult-customize consult-recent-file :preview-key nil)
  (consult-customize consult-org-heading :preview-key nil)
  (define-key minibuffer-mode-map (kbd "C-s") 'consult-history)
  (define-key minibuffer-mode-map (kbd "C-r") 'consult-history))

(setq completion-in-region-function
      (lambda (&rest args)
        (apply (if vertico-mode
                   'consult-completion-in-region
                 'completion--in-region)
               args)))

(global-set-key (kbd "C-c r") 'consult-recent-file)

(with-eval-after-load 'org
  (define-key org-mode-map (kbd "C-c o") 'consult-org-heading))
#+end_src

** Hide some commands

#+begin_src emacs-lisp
(setq read-extended-command-predicate 'command-completion-default-include-p)
#+end_src

* Completion in region

** Defaults

#+begin_src emacs-lisp
(straight-use-package 'corfu)

(with-eval-after-load 'corfu
  (setq corfu-preview-current nil))

(global-corfu-mode 1)
#+end_src

** Transfer to the minibuffer

#+begin_src emacs-lisp
(with-eval-after-load 'corfu
  (defun corfu-move-to-minibuffer ()
    (interactive)
    (let ((completion-extra-properties corfu--extra)
          completion-cycle-threshold completion-cycling)
      (apply #'consult-completion-in-region completion-in-region--data)))
  (define-key corfu-map "\M-m" #'corfu-move-to-minibuffer))
#+end_src

* Shells

** Eshell

*** Completions

#+begin_src emacs-lisp
(defun corfu-send-shell (&rest _)
  (cond
   ((and (derived-mode-p 'eshell-mode) (fboundp 'eshell-send-input))
    (eshell-send-input))
   ((and (derived-mode-p 'comint-mode) (fboundp 'comint-send-input))
    (comint-send-input))))

(advice-add 'corfu-insert :after 'corfu-send-shell)
#+end_src

*** History

#+begin_src emacs-lisp
(defun crz/eshell-history-config ()
  (add-hook 'eshell-pre-command-hook 'eshell-save-some-history)
  (setq eshell-history-size 1000
        eshell-hist-ignoredups t)
  (define-key eshell-mode-map (kbd "C-r") 'consult-history))
#+end_src

