.emacs.d/init.el
;; -*- lexical-binding: t; -*-

(setq straight-check-for-modifications nil)

(defvar bootstrap-version)

(let ((bootstrap-file
       (expand-file-name "straight/repos/straight.el/bootstrap.el" user-emacs-directory))
      (bootstrap-version 5))
  (unless (file-exists-p bootstrap-file)
    (with-current-buffer
        (url-retrieve-synchronously
         "https://raw.githubusercontent.com/raxod502/straight.el/develop/install.el"
         'silent 'inhibit-cookies)
      (goto-char (point-max))
      (eval-print-last-sexp)))
  (load bootstrap-file nil 'nomessage))

(with-eval-after-load 'straight
  (setq straight-vc-git-default-clone-depth 1))

(setq custom-file (expand-file-name "custom.el" user-emacs-directory))

(when (file-exists-p custom-file)
  (load custom-file nil t))

(setq backup-directory-alist `((".*" . ,(expand-file-name "backups" user-emacs-directory)))
      backup-by-copying t
      version-control t
      delete-old-versions t
      vc-make-backup-files t
      kept-old-versions 10
      kept-new-versions 10)

(setq auto-save-list-file-prefix (expand-file-name "autosaves/" user-emacs-directory)
      auto-save-file-name-transforms `((".*" ,(expand-file-name "autosaves/" user-emacs-directory) t)))

(setq recentf-max-saved-items 50
      recentf-auto-cleanup 300)

(recentf-mode 1)

(setq-default vc-follow-symlinks)

(setq use-short-answers t)

(with-eval-after-load 'browse-url
  (when (getenv "BROWSER")
    (setq browse-url-generic-program (executable-find (getenv "BROWSER"))
          browse-url-browser-function 'browse-url-generic)))

(cd "~/")

(setq-default buffer-file-coding-system 'utf-8-unix
              default-file-name-coding-system 'utf-8-unix
              default-keyboard-coding-system 'utf-8-unix
              default-process-coding-system '(utf-8-unix . utf-8-unix)
              default-sendmail-coding-system 'utf-8-unix
              default-terminal-coding-system 'utf-8-unix)

(global-auto-revert-mode 1)

(setq global-auto-revert-non-file-buffers t)

(setq delete-by-moving-to-trash t
      trash-directory (expand-file-name "emacs-trash" temporary-file-directory))

(setq large-file-warning-threshold nil)

(setq-default indent-tabs-mode nil
              tab-width 4)

(delete-selection-mode 1)

(with-eval-after-load 'help
  (setq help-window-select t))

(setenv "PAGER" "cat")
(setenv "MANPAGER" "cat")

(setq disabled-command-function nil)

(global-set-key (kbd "M-&") 'with-editor-async-shell-command)

(setq kill-do-not-save-duplicates t)

(with-eval-after-load 'woman
  (setq woman-fill-frame t))

(defun crz/insert-buffer-name (buffer-name)
  (interactive "BName of buffer: ")
  (insert-and-inherit buffer-name))

(global-set-key (kbd "C-x x b") 'crz/insert-buffer-name)

(defvar-local hide-cursor--original nil)

(define-minor-mode pager-mode
  "View buffer as a pager."
  :global nil
  :lighter " Pager"
  (if pager-mode
      (progn
        (scroll-lock-mode 1)
        (setq-local hide-cursor--original
                    cursor-type)
        (setq-local cursor-type nil))
    (scroll-lock-mode 0)
    (setq-local cursor-type (or hide-cursor--original t))))

(straight-use-package 'ace-window)

(with-eval-after-load 'ace-window
  (setq aw-scope 'frame
        aw-ignore-current t))

(global-set-key (kbd "M-o") 'ace-window)

(straight-use-package 'popper)

(with-eval-after-load 'popper
  (setq popper-reference-buffers
        '("\\*Async Shell Command\\*"
          "\\*DWIM shell command\\* done"
          grep-mode
          debugger-mode)))

(global-set-key (kbd "M-'") 'popper-toggle-latest)
(global-set-key (kbd "C-'") 'popper-cycle)
(global-set-key (kbd "C-M-'") 'popper-toggle-type)

(popper-mode 1)
(popper-echo-mode 1)

(setq history-length 50
      history-delete-duplicates t)

(savehist-mode 1)

(setq enable-recursive-minibuffers t)

(straight-use-package 'vertico)

(vertico-mode 1)

(straight-use-package 'orderless)

(with-eval-after-load 'vertico
  (setq completion-styles '(orderless)
        orderless-matching-styles '(orderless-flex)))

(straight-use-package 'consult)

(with-eval-after-load 'consult
  (consult-customize consult-recent-file :preview-key nil)
  (consult-customize consult-org-heading :preview-key nil)
  (define-key minibuffer-mode-map (kbd "C-s") 'consult-history)
  (define-key minibuffer-mode-map (kbd "C-r") 'consult-history))

(setq completion-in-region-function
      (lambda (&rest args)
        (apply (if vertico-mode
                   'consult-completion-in-region
                 'completion--in-region)
               args)))

(global-set-key (kbd "C-c r") 'consult-recent-file)

(with-eval-after-load 'org
  (define-key org-mode-map (kbd "C-c o") 'consult-org-heading))

(setq read-extended-command-predicate 'command-completion-default-include-p)

(straight-use-package 'corfu)

(with-eval-after-load 'corfu
  (setq corfu-preview-current nil))

(global-corfu-mode 1)

(with-eval-after-load 'corfu
  (defun corfu-move-to-minibuffer ()
    (interactive)
    (let ((completion-extra-properties corfu--extra)
          completion-cycle-threshold completion-cycling)
      (apply #'consult-completion-in-region completion-in-region--data)))
  (define-key corfu-map "\M-m" #'corfu-move-to-minibuffer))

(defun corfu-send-shell (&rest _)
  (cond
   ((and (derived-mode-p 'eshell-mode) (fboundp 'eshell-send-input))
    (eshell-send-input))
   ((and (derived-mode-p 'comint-mode) (fboundp 'comint-send-input))
    (comint-send-input))))

(advice-add 'corfu-insert :after 'corfu-send-shell)

(defun crz/eshell-history-config ()
  (add-hook 'eshell-pre-command-hook 'eshell-save-some-history)
  (setq eshell-history-size 1000
        eshell-hist-ignoredups t)
  (define-key eshell-mode-map (kbd "C-r") 'consult-history))

(defun crz/eshell-prompt ()
  (concat
