.emacs.d/config.org
*** Prompt

#+begin_src emacs-lisp
(defun crz/eshell-prompt ()
  (concat
   (propertize " " 'face '(:background "#2544bb"))
   (propertize (abbreviate-file-name (eshell/pwd))
               'face '(:background "#2544bb" :foreground "#ffffff"))
   (propertize " " 'face '(:background "#2544bb"))
   (propertize "$" 'invisible t) " "))

(defun crz/eshell-prompt-config ()
  (setq eshell-prompt-regexp "^[^$\n]*\\\$ "
        eshell-prompt-function 'crz/eshell-prompt)
  (setq-local outline-regexp eshell-prompt-regexp)
  (define-key eshell-mode-map (kbd "C-c s") 'consult-outline))
#+end_src

*** Colors

#+begin_src emacs-lisp
(straight-use-package 'xterm-color)

(defun crz/eshell-colors-config ()
  (add-to-list 'eshell-preoutput-filter-functions 'xterm-color-filter)
  (delq 'eshell-handle-ansi-color eshell-output-filter-functions)
  (add-hook 'eshell-before-prompt-hook
            (lambda ()
              (setq xterm-color-preserve-properties t)))
  (setq xterm-color-use-bold-for-bright t)
  (setenv "TERM" "xterm-256color"))
#+end_src

*** Aliases

**** Config

#+begin_src emacs-lisp
(defun crz/eshell-alias-config ()
  (setq eshell-aliases-file "~/.emacs.d/eshell-aliases")
  (eshell-read-aliases-list))
#+end_src

**** List

#+begin_src fundamental :tangle eshell-aliases
alias f find-file $1
alias fo find-file-other-window $1
alias v view-file $1
alias vo view-file-other-window $1
alias d dired $1
alias do dired-other-window $1
alias c eshell/clear-scrollback

alias xi sudo xbps-install $*
alias xr sudo xbps-remove -Ro $*
alias xu sudo xbps-install -Su
alias xqs xbps-query -Rs $*
alias xf xlocate $*

alias ls ls -AC --color=always --group-directories-first $*
alias ll ls -lhA --color=always --group-directories-first $*
alias tree tree -C $*

alias - cd -
alias rm rm -rfI $*
alias mkdir mkdir -p $*
alias cat cat -n $*

alias grep grep --color=always $*
alias zgrep zgrep --color=always $*

alias wttr curl -s wttr.in
alias qttr curl -s wttr.in/?0Q
alias ping ping -c 3 gnu.org
alias free free -h
#+end_src

*** Defaults

#+begin_src emacs-lisp
(defun crz/eshell-config ()
  (crz/eshell-history-config)
  (crz/eshell-prompt-config)
  (crz/eshell-alias-config)
  (crz/eshell-colors-config)
  (add-to-list 'eshell-output-filter-functions 'eshell-truncate-buffer)
  (setq eshell-buffer-maximum-lines 1000
        eshell-scroll-to-bottom-on-input t
        eshell-destroy-buffer-when-process-dies t))

(with-eval-after-load 'eshell
  (add-hook 'eshell-mode-hook 'crz/eshell-config))

(global-set-key (kbd "C-c e") 'eshell)
#+end_src

** Vterm

#+begin_src emacs-lisp
(straight-use-package 'vterm)

(with-eval-after-load 'vterm
  (setq vterm-kill-buffer-on-exit t))

(global-set-key (kbd "C-c t") 'vterm)
#+end_src

* Dired

#+begin_src emacs-lisp
(straight-use-package 'diredfl)

(with-eval-after-load 'dired
  (setq dired-listing-switches "-lha --group-directories-first")
  (define-key dired-mode-map (kbd "RET") 'dired-find-alternate-file)
  (define-key dired-mode-map (kbd "f") 'dired-create-empty-file)
  (diredfl-global-mode))

(global-set-key (kbd "C-x C-d") 'dired-jump)
#+end_src

* Ibuffer

** Human readable size column

#+begin_src emacs-lisp
(defun crz/human-readable-file-sizes-to-bytes (string)
  "Convert a human-readable file size into bytes."
  (cond
   ((string-suffix-p "G" string t)
    (* 1000000000 (string-to-number (substring string 0 (- (length string) 1)))))
   ((string-suffix-p "M" string t)
    (* 1000000 (string-to-number (substring string 0 (- (length string) 1)))))
   ((string-suffix-p "K" string t)
    (* 1000 (string-to-number (substring string 0 (- (length string) 1)))))
   (t
    (string-to-number (substring string 0 (- (length string) 1))))))

(defun crz/bytes-to-human-readable-file-sizes (bytes)
  "Convert number of bytes to human-readable file size."
  (cond
   ((> bytes 1000000000) (format "%10.1fG" (/ bytes 1000000000.0)))
   ((> bytes 100000000) (format "%10.0fM" (/ bytes 1000000.0)))
   ((> bytes 1000000) (format "%10.1fM" (/ bytes 1000000.0)))
   ((> bytes 100000) (format "%10.0fK" (/ bytes 1000.0)))
   ((> bytes 1000) (format "%10.1fK" (/ bytes 1000.0)))
   (t (format "%10d" bytes))))

(with-eval-after-load 'ibuffer
  (define-ibuffer-column size-h
    (:name "Size"
           :inline t
           :summarizer
           (lambda (column-strings)
             (let ((total 0))
               (dolist (string column-strings)
                 (setq total
                       (+ (float (crz/human-readable-file-sizes-to-bytes string))
                          total)))
               (crz/bytes-to-human-readable-file-sizes total))))
    (crz/bytes-to-human-readable-file-sizes (buffer-size))))
#+end_src

** Groups

#+begin_src emacs-lisp
(with-eval-after-load 'ibuffer
  (setq ibuffer-saved-filter-groups
        '(("Default"
           ("Modified" (and (modified . t)
                            (visiting-file . t)))
           ("Term" (or (mode . vterm-mode)
                       (mode . eshell-mode)
                       (mode . term-mode)
                       (mode . shell-mode)))
           ("Debug" (mode . debugger-mode))
           ("Agenda" (filename . "agenda.org"))
           ("Org" (mode . org-mode))
           ("Magit" (or (mode . magit-process-mode)
                        (mode . magit-diff-mode)
                        (mode . magit-status-mode)
                        (mode . magit-revision-mode)))
           ("Book" (or (mode . pdf-view-mode)
                       (mode . nov-mode)))
           ("Dired" (mode . dired-mode))
           ("Chat" (mode . erc-mode))
           ("Help" (or (name . "\*Help\*")
                       (name . "\*Apropos\*")
                       (name . "\*info\*")
                       (mode . help-mode)
                       (mode . woman-mode)
                       (mode . Man-mode)))
           ("Image" (mode . image-mode))
           ("Games" (mode . gomoku-mode))
           ("Internal" (name . "^\*.*$"))
           ("Misc" (name . "^.*$")))))
  (setq ibuffer-show-empty-filter-groups nil))

(add-hook 'ibuffer-mode-hook
          (lambda ()
            (ibuffer-switch-to-saved-filter-groups "Default")))
#+end_src

** Defaults

#+begin_src emacs-lisp
(with-eval-after-load 'ibuffer
  (setq ibuffer-formats '((mark modified read-only locked " "
                                (name 20 20 :left :elide)
                                " "
                                (size-h 11 -1 :right)
                                " "
                                (mode 16 16 :left :elide)
                                " " filename-and-process)
                          (mark " "
                                (name 16 -1)
                                " " filename))))

(global-set-key (kbd "C-x C-b") 'ibuffer)

(add-hook 'ibuffer-mode-hook 'ibuffer-auto-mode)
#+end_src

* Language modes

** LSP

#+begin_src emacs-lisp
(straight-use-package 'eglot)
#+end_src

** Markdown

#+begin_src emacs-lisp
(straight-use-package 'markdown-mode)

(add-to-list 'auto-mode-alist '("\\.md\\'" . markdown-mode))
(add-to-list 'auto-mode-alist '("README\\.md\\'" . gfm-mode))
#+end_src

** Go

#+begin_src emacs-lisp
(straight-use-package 'go-mode)

(add-hook 'go-mode-hook 'eglot-ensure)
#+end_src

* Visual

** Maximize the frame

#+begin_src emacs-lisp
(setq frame-resize-pixelwise t)
#+end_src

** Line number

#+begin_src emacs-lisp
(add-hook 'prog-mode-hook 'display-line-numbers-mode)
#+end_src

** Column number

#+begin_src emacs-lisp
(column-number-mode 1)
#+end_src

** Color codes

#+begin_src emacs-lisp
(straight-use-package 'rainbow-mode)
#+end_src

** Cursor

#+begin_src emacs-lisp
(setq-default cursor-type 'bar
              cursor-in-non-selected-windows nil)

(blink-cursor-mode 0)
#+end_src

** Tab bar

#+begin_src emacs-lisp
(with-eval-after-load 'tab-bar
  (setq tab-bar-new-button nil
        tab-bar-close-button nil
        tab-bar-back-button nil
        tab-bar-border nil
        tab-bar-tab-name-function 'tab-bar-tab-name-truncated
        tab-bar-tab-name-truncated-max 15
        tab-bar-show 1)
  (global-set-key (kbd "C-<tab>") 'tab-recent)
  (global-set-key (kbd "C-x t b") 'tab-switch))
#+end_src

** Font

#+begin_src emacs-lisp
(defvar crz/font "Iosevka Slab 10")

(defun crz/set-font-faces ()
  (set-face-attribute 'default nil :font crz/font)
  (set-face-attribute 'fixed-pitch nil :font crz/font)
  (set-face-attribute 'variable-pitch nil :font crz/font))

(if (daemonp)
    (add-hook 'after-make-frame-functions
              (lambda (frame)
                (with-selected-frame frame (crz/set-font-faces))))
  (crz/set-font-faces))
#+end_src

** Theme

#+begin_src emacs-lisp
(setq modus-themes-subtle-line-numbers t
      modus-themes-org-blocks 'gray-background
      modus-themes-mode-line '(borderless))

(load-theme 'modus-operandi t)
#+end_src

** Dialog box

#+begin_src emacs-lisp
(setq use-dialog-box nil)
#+end_src

