.emacs.d/init.el
   (propertize " " 'face '(:background "#2544bb"))
   (propertize (abbreviate-file-name (eshell/pwd))
               'face '(:background "#2544bb" :foreground "#ffffff"))
   (propertize " " 'face '(:background "#2544bb"))
   (propertize "$" 'invisible t) " "))

(defun crz/eshell-prompt-config ()
  (setq eshell-prompt-regexp "^[^$\n]*\\\$ "
        eshell-prompt-function 'crz/eshell-prompt)
  (setq-local outline-regexp eshell-prompt-regexp)
  (define-key eshell-mode-map (kbd "C-c s") 'consult-outline))

(straight-use-package 'xterm-color)

(defun crz/eshell-colors-config ()
  (add-to-list 'eshell-preoutput-filter-functions 'xterm-color-filter)
  (delq 'eshell-handle-ansi-color eshell-output-filter-functions)
  (add-hook 'eshell-before-prompt-hook
            (lambda ()
              (setq xterm-color-preserve-properties t)))
  (setq xterm-color-use-bold-for-bright t)
  (setenv "TERM" "xterm-256color"))

(defun crz/eshell-alias-config ()
  (setq eshell-aliases-file "~/.emacs.d/eshell-aliases")
  (eshell-read-aliases-list))

(defun crz/eshell-config ()
  (crz/eshell-history-config)
  (crz/eshell-prompt-config)
  (crz/eshell-alias-config)
  (crz/eshell-colors-config)
  (add-to-list 'eshell-output-filter-functions 'eshell-truncate-buffer)
  (setq eshell-buffer-maximum-lines 1000
        eshell-scroll-to-bottom-on-input t
        eshell-destroy-buffer-when-process-dies t))

(with-eval-after-load 'eshell
  (add-hook 'eshell-mode-hook 'crz/eshell-config))

(global-set-key (kbd "C-c e") 'eshell)

(straight-use-package 'vterm)

(with-eval-after-load 'vterm
  (setq vterm-kill-buffer-on-exit t))

(global-set-key (kbd "C-c t") 'vterm)

(straight-use-package 'diredfl)

(with-eval-after-load 'dired
  (setq dired-listing-switches "-lha --group-directories-first")
  (define-key dired-mode-map (kbd "RET") 'dired-find-alternate-file)
  (define-key dired-mode-map (kbd "f") 'dired-create-empty-file)
  (diredfl-global-mode))

(global-set-key (kbd "C-x C-d") 'dired-jump)

(defun crz/human-readable-file-sizes-to-bytes (string)
  "Convert a human-readable file size into bytes."
  (cond
   ((string-suffix-p "G" string t)
    (* 1000000000 (string-to-number (substring string 0 (- (length string) 1)))))
   ((string-suffix-p "M" string t)
    (* 1000000 (string-to-number (substring string 0 (- (length string) 1)))))
   ((string-suffix-p "K" string t)
    (* 1000 (string-to-number (substring string 0 (- (length string) 1)))))
   (t
    (string-to-number (substring string 0 (- (length string) 1))))))

(defun crz/bytes-to-human-readable-file-sizes (bytes)
  "Convert number of bytes to human-readable file size."
  (cond
   ((> bytes 1000000000) (format "%10.1fG" (/ bytes 1000000000.0)))
   ((> bytes 100000000) (format "%10.0fM" (/ bytes 1000000.0)))
   ((> bytes 1000000) (format "%10.1fM" (/ bytes 1000000.0)))
   ((> bytes 100000) (format "%10.0fK" (/ bytes 1000.0)))
   ((> bytes 1000) (format "%10.1fK" (/ bytes 1000.0)))
   (t (format "%10d" bytes))))

(with-eval-after-load 'ibuffer
  (define-ibuffer-column size-h
    (:name "Size"
           :inline t
           :summarizer
           (lambda (column-strings)
             (let ((total 0))
               (dolist (string column-strings)
                 (setq total
                       (+ (float (crz/human-readable-file-sizes-to-bytes string))
                          total)))
               (crz/bytes-to-human-readable-file-sizes total))))
    (crz/bytes-to-human-readable-file-sizes (buffer-size))))

(with-eval-after-load 'ibuffer
  (setq ibuffer-saved-filter-groups
        '(("Default"
           ("Modified" (and (modified . t)
                            (visiting-file . t)))
           ("Term" (or (mode . vterm-mode)
                       (mode . eshell-mode)
                       (mode . term-mode)
                       (mode . shell-mode)))
           ("Debug" (mode . debugger-mode))
           ("Agenda" (filename . "agenda.org"))
           ("Org" (mode . org-mode))
           ("Magit" (or (mode . magit-process-mode)
                        (mode . magit-diff-mode)
                        (mode . magit-status-mode)
                        (mode . magit-revision-mode)))
           ("Book" (or (mode . pdf-view-mode)
                       (mode . nov-mode)))
           ("Dired" (mode . dired-mode))
           ("Chat" (mode . erc-mode))
           ("Help" (or (name . "\*Help\*")
                       (name . "\*Apropos\*")
                       (name . "\*info\*")
                       (mode . help-mode)
                       (mode . woman-mode)
                       (mode . Man-mode)))
           ("Image" (mode . image-mode))
           ("Games" (mode . gomoku-mode))
           ("Internal" (name . "^\*.*$"))
           ("Misc" (name . "^.*$")))))
  (setq ibuffer-show-empty-filter-groups nil))

(add-hook 'ibuffer-mode-hook
          (lambda ()
            (ibuffer-switch-to-saved-filter-groups "Default")))

(with-eval-after-load 'ibuffer
  (setq ibuffer-formats '((mark modified read-only locked " "
                                (name 20 20 :left :elide)
                                " "
                                (size-h 11 -1 :right)
                                " "
                                (mode 16 16 :left :elide)
                                " " filename-and-process)
                          (mark " "
                                (name 16 -1)
                                " " filename))))

(global-set-key (kbd "C-x C-b") 'ibuffer)

(add-hook 'ibuffer-mode-hook 'ibuffer-auto-mode)

(straight-use-package 'markdown-mode)

(add-to-list 'auto-mode-alist '("\\.md\\'" . markdown-mode))
(add-to-list 'auto-mode-alist '("README\\.md\\'" . gfm-mode))

(setq frame-resize-pixelwise t)

(add-hook 'prog-mode-hook 'display-line-numbers-mode)

(column-number-mode 1)

(straight-use-package 'rainbow-mode)

(setq-default cursor-type 'bar
              cursor-in-non-selected-windows nil)

(blink-cursor-mode 0)

(with-eval-after-load 'tab-bar
  (setq tab-bar-new-button nil
        tab-bar-close-button nil
        tab-bar-back-button nil
        tab-bar-border nil
        tab-bar-tab-name-function 'tab-bar-tab-name-truncated
        tab-bar-tab-name-truncated-max 15
        tab-bar-show 1)
  (global-set-key (kbd "C-<tab>") 'tab-recent)
  (global-set-key (kbd "C-x t b") 'tab-switch))

(defvar crz/font "Iosevka Slab 10")

(defun crz/set-font-faces ()
  (set-face-attribute 'default nil :font crz/font)
  (set-face-attribute 'fixed-pitch nil :font crz/font)
  (set-face-attribute 'variable-pitch nil :font crz/font))

(if (daemonp)
    (add-hook 'after-make-frame-functions
              (lambda (frame)
                (with-selected-frame frame (crz/set-font-faces))))
  (crz/set-font-faces))

(setq modus-themes-subtle-line-numbers t
      modus-themes-org-blocks 'gray-background
      modus-themes-mode-line '(borderless))

(load-theme 'modus-operandi t)

(setq use-dialog-box nil)
