.emacs.d/init.el

(with-eval-after-load 'time
  (setq display-time-default-load-average nil
        display-time-24hr-format t))

(display-time-mode 1)

(straight-use-package '(org :type built-in))

(with-eval-after-load 'org
  (setq org-files-directory "~/media/docs/org"
        org-return-follows-link t))

(add-to-list 'auto-mode-alist '("\\.org$" . org-mode))

(with-eval-after-load 'org
  (setq org-startup-indented t
        org-startup-with-inline-images t
        org-image-actual-width '(600)
        org-startup-folded t
        org-hide-emphasis-markers t
        org-ellipsis " ▾"))

(add-hook 'org-mode-hook 'visual-line-mode)

(straight-use-package 'org-superstar)

(with-eval-after-load 'org-superstar
  (setq org-superstar-headline-bullets-list '(9673 9675 10040)))

(add-hook 'org-mode-hook 'org-superstar-mode)

(with-eval-after-load 'org
  (add-to-list 'org-modules 'org-tempo)
  (setq org-src-window-setup 'current-window
        org-edit-src-content-indentation 0)
  (add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
  (add-to-list 'org-structure-template-alist '("li" . "src lisp")))

(with-eval-after-load 'org
  (setq org-agenda-start-with-log-mode t
        org-log-done 'time
        org-log-into-drawer t
        org-agenda-files '("~/media/docs/agenda.org")))

(global-set-key (kbd "C-c a") 'org-agenda)

(straight-use-package 'magit)

;; (with-eval-after-load 'magit
;;   (setq epg-pinentry-mode 'loopback
;;         epa-pinentry-mode 'loopback))

;; (straight-use-package 'pinentry)

;; (pinentry-start 1)

(straight-use-package
 '(dwim-shell-command
   :type git :host github
   :repo "xenodium/dwim-shell-command"))

(with-eval-after-load 'dwim-shell-command
  (global-set-key (kbd "M-!") 'dwim-shell-command)
  (define-key dired-mode-map (kbd "!") 'dwim-shell-command))

(run-with-idle-timer 2 nil 'require 'dwim-shell-command)
(run-with-idle-timer 2 nil 'require 'dwim-shell-commands)

(with-eval-after-load 'dwim-shell-command
  (defun dwim-shell-commands-flac-to-mp3 ()
    (interactive)
    (dwim-shell-command-on-marked-files
     "Convert flac to mp3"
     "ffmpeg -stats -n -i '<<f>>' -qscale:a 0 '<<fne>>.mp3'"
     :utils "ffmpeg")))

(straight-use-package
 '(pdf-tools :type git :host github :repo "vedang/pdf-tools"))

(with-eval-after-load 'pdf-tools
  (setq pdf-view-continuous nil))

(pdf-tools-install :noquery)

(add-to-list 'auto-mode-alist '("\\.[pP][dD][fF]\\'" . pdf-view-mode))

(straight-use-package 'pdf-view-restore)

(add-hook 'pdf-view-mode-hook 'pdf-view-restore-mode)

(straight-use-package 'nov.el)
(straight-use-package 'esxml)

(add-to-list 'auto-mode-alist '("\\.epub\\'" . nov-mode))

(straight-use-package 'erc-hl-nicks)

(with-eval-after-load 'erc
  (setq erc-accidental-paste-threshold-seconds nil
        erc-nick "crzjp"
        erc-fill-column (- (window-width) 1)
        erc-fill-function 'erc-fill-static
        erc-fill-static-center 20
        erc-image-inline-rescale 200
        erc-prompt (lambda () (concat "[" (buffer-name) "]")))
  (add-to-list 'erc-modules 'autojoin)
  (add-to-list 'erc-modules 'notifications)
  (add-to-list 'erc-modules 'hl-nicks))

(defalias 'erc 'erc-tls)

(with-eval-after-load 'gnus
  (setq gnus-select-method '(nnnil "")
        gnus-secondary-select-methods '((nnimap "mail.riseup.net")
                                        (nnimap "mail.cock.li"))))

(straight-use-package 'transmission)

(with-eval-after-load 'transmission
  (setq transmission-refresh-modes '(transmission-mode
                                     transmission-files-mode
                                     transmission-info-mode
                                     transmission-peers-mode)))

(straight-use-package '0x0)

(with-eval-after-load '0x0
  (setq 0x0-servers '((0x0
                       :scheme "https"
                       :host "0x0.st"
                       :default-dir "~/"
                       :curl-args-fun 0x0--make-0x0-curl-args
                       :min-age 30
                       :max-age 365
                       :max-size ,(* 1024 1024 512)))))

(straight-use-package 'emms) 

(with-eval-after-load 'emms
  (emms-all)
  (setq emms-source-file-default-directory "~/media/musics"
        emms-player-mpd-music-directory "~/media/musics"
        emms-browser-covers 'emms-browser-cache-thumbnail-async
        emms-source-file-directory-tree-function
        'emms-source-file-directory-tree-find
        emms-player-mpd-server-name "localhost"
        emms-player-mpd-server-port "6600"
        emms-mode-line-format " [%s]")
  (add-to-list 'emms-info-functions 'emms-info-mpd)
  (add-to-list 'emms-player-list 'emms-player-mpd)
  (emms-player-mpd-sync-from-mpd)
  (emms-player-mpd-connect)
  (emms-playing-time-display-mode 0))
